In [1]:
import pandas as pd

## 손익계산서 기업코드 앞 0 넣기

In [20]:
interest = pd.read_csv("./손익계산서.csv")

In [6]:
interest.head()

,Unnamed: 0,기업코드,회차,등록일,수익(매출액),영업이익(손실),당기순이익(손실)
0,0,956028,제 16 기,20180420,"24,347,218","120,381","-1,629,679"
1,1,1165739,제 3 기,20180430,NaN,"-3,982,045","-13,864,646"
2,2,171636,제 53 기,20180402,NaN,"14,952,676,720","-143,685,542,254"
3,3,147772,제 49 기,20180330,NaN,NaN,NaN
4,4,273110,제 29 기,20180402,NaN,"-8,455,346,598","-10,797,600,612"

In [21]:
interest['기업코드'] = interest['기업코드'].apply(lambda x: "{:0>8d}".format(x))

In [22]:
interest['기업코드'].head()

0    00956028
1    01165739
2    00171636
3    00147772
4    00273110
Name: 기업코드, dtype: object

In [24]:
interest.to_excel('손익계산서_v2.xlsx', encoding='euc-kr')

## 재무상태표 기업코드 앞 0 넣기

In [25]:
finance = pd.read_csv("./재무상태표.csv")

In [26]:
finance['기업코드'] = finance['기업코드'].apply(lambda x: "{:0>8d}".format(x))

In [27]:
finance['기업코드'].head()

0    00956028
1    01165739
2    00171636
3    00147772
4    00273110
Name: 기업코드, dtype: object

In [28]:
finance.to_excel('재무상태표_v2.xlsx', encoding='euc-kr')

## 현금흐름표 기업코드 앞 0 넣기

In [29]:
cash = pd.read_csv("./현금흐름표.csv")

In [30]:
cash['기업코드'] = cash['기업코드'].apply(lambda x: "{:0>8d}".format(x))

In [31]:
cash['기업코드'].head()

0    00956028
1    01165739
2    00171636
3    00147772
4    00273110
Name: 기업코드, dtype: object

In [32]:
cash.to_excel('현금흐름표_v2.xlsx', encoding='euc-kr')

## 대표자 테이블 null값 확인

In [33]:
ceo = pd.read_excel('대표자_v4.xlsx')

In [54]:
ceo.head()

   Unnamed: 0  corp_code ceo_nm
0           0     434003    김상규
1           1     434456    이광선
2           2     430964    정진형
3           3     432403    정우석
4           4     388953    배경오

In [34]:
ceo.isnull().sum()

Unnamed: 0     0
corp_code      0
ceo_nm        20
dtype: int64

In [41]:
ceo_null = []
ceo_null.append(ceo.isnull())

In [42]:
ceo_null

[       Unnamed: 0  corp_code  ceo_nm
 0           False      False   False
 1           False      False   False
 2           False      False   False
 3           False      False   False
 4           False      False   False
 ...           ...        ...     ...
 84794       False      False   False
 84795       False      False   False
 84796       False      False   False
 84797       False      False   False
 84798       False      False   False

 [84799 rows x 3 columns]]

In [46]:
ceo["ceo_nm"].isnull().values.any()

True

In [48]:
ceo_null_idx = ceo[ceo['ceo_nm'].isnull()].index.tolist()

In [49]:
ceo_null_idx

[1590,
 2082,
 2098,
 2238,
 2251,
 2404,
 2535,
 2536,
 2546,
 2967,
 2970,
 3029,
 3032,
 3050,
 3816,
 3981,
 18226,
 24178,
 78716,
 78717]

In [52]:
ceo_null_corp_code=[]
for i in ceo_null_idx:
    ceo_null_corp_code.append(ceo['corp_code'].iloc[i])

In [53]:
ceo_null_corp_code

[113340,
 102803,
 190686,
 164751,
 164803,
 260259,
 106632,
 157797,
 103352,
 114446,
 117319,
 272324,
 242873,
 465881,
 260134,
 391993,
 632881,
 420301,
 161125,
 161125]

밑의 두 기업의 대표는 엑셀에서 삭제함. 형식파괴자라서.

## 재무제표 부모 테이블 생성

In [61]:
parent = pd.DataFrame({"기업코드" : cash['기업코드'], "회차" : cash['회차'], "등록일" : cash['등록일']})

In [62]:
parent.head()

       기업코드      회차       등록일
0  00956028  제 16 기  20180420
1  01165739   제 3 기  20180430
2  00171636  제 53 기  20180402
3  00147772  제 49 기  20180330
4  00273110  제 29 기  20180402

In [63]:
len(parent)

5925

In [64]:
parent.to_excel('재무제표_v1.xlsx', encoding='euc-kr')

## 손익계사